In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
from scipy.stats import skew
from pydataset import data
import matplotlib.pyplot as plt

In [14]:
df_uni = pd.read_csv('4. Conceptos estadísticos/files/cwurData.csv', index_col = 0)
df_uni.head()

,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
world_rank,,,,,,,,,,,,,
1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

Homogeneizamos nuestros datos

In [16]:
columnas_min = {col:col.lower().strip().replace(" ","_") for col in df_uni.columns}
df_uni.rename(columns = columnas_min, inplace=True)
df_uni.columns

Index(['institution', 'country', 'national_rank', 'quality_of_education',
       'alumni_employment', 'quality_of_faculty', 'publications', 'influence',
       'citations', 'broad_impact', 'patents', 'score', 'year'],
      dtype='object')

Al igual que en los ejercicios de pair programming de estadística, deberéis elegir un set de datos, puede ser de cualquier tipo. El objetivo de este pair programming es:

1. Hacer una exploración inicial del dataframe.

- ¿Cuántas filas tiene?
- ¿Cuántas nulos tiene?
- ¿Y duplicados?
- ¿Qué tipo de datos tenemos en el dataframe?
- etc

In [18]:
print(f'Nuestro dataframe tiene {df_uni.shape[0]} filas y {df_uni.shape[1]} columnas')

Nuestro dataframe tiene 2200 filas y 13 columnas

In [22]:
df_uni.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2200 entries, 1 to 1000
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   institution           2200 non-null   object
 1   country               2200 non-null   object
 2   national_rank         2200 non-null   int64
 3   quality_of_education  2200 non-null   int64
 4   alumni_employment     2200 non-null   int64
 5   quality_of_faculty    2200 non-null   int64
 6   publications          2200 non-null   int64
 7   influence             2200 non-null   int64
 8   citations             2200 non-null   int64
 9   broad_impact          2000 non-null   float64
 10  patents               2200 non-null   int64
 11  score                 2200 non-null   float64
 12  year                  2200 non-null   int64
dtypes: float64(2), int64(9), object(2)
memory usage: 240.6+ KB

- Miramos cuantos nulos tenemos por columna

In [23]:
df_uni.isnull().sum()

institution               0
country                   0
national_rank             0
quality_of_education      0
alumni_employment         0
quality_of_faculty        0
publications              0
influence                 0
citations                 0
broad_impact            200
patents                   0
score                     0
year                      0
dtype: int64

Son unos datos bastante buenos, hay 0 nulos, exceptuando la columna borad_impact, que tiene 200.

- Duplicados

In [26]:
df_uni.duplicated().sum()

0

No existen valores duplicados

- Tipo de datos

In [30]:
df_uni.info()
# También se puede ver con df_uni.dtypes

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2200 entries, 1 to 1000
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   institution           2200 non-null   object
 1   country               2200 non-null   object
 2   national_rank         2200 non-null   int64
 3   quality_of_education  2200 non-null   int64
 4   alumni_employment     2200 non-null   int64
 5   quality_of_faculty    2200 non-null   int64
 6   publications          2200 non-null   int64
 7   influence             2200 non-null   int64
 8   citations             2200 non-null   int64
 9   broad_impact          2000 non-null   float64
 10  patents               2200 non-null   int64
 11  score                 2200 non-null   float64
 12  year                  2200 non-null   int64
dtypes: float64(2), int64(9), object(2)
memory usage: 240.6+ KB

2 de nuestras columnas son categóricas, el resto númericas. 9 de estas son de tipo int64 y 2 son float64.

- Otras exploraciones

In [31]:
df_uni.describe().T

,count,mean,std,min,25%,50%,75%,max
national_rank,2200.0,40.278182,51.740870,1.00,6.00,21.0,49.000,229.0
quality_of_education,2200.0,275.100455,121.935100,1.00,175.75,355.0,367.000,367.0
alumni_employment,2200.0,357.116818,186.779252,1.00,175.75,450.5,478.000,567.0
quality_of_faculty,2200.0,178.888182,64.050885,1.00,175.75,210.0,218.000,218.0
publications,2200.0,459.908636,303.760352,1.00,175.75,450.5,725.000,1000.0
influence,2200.0,459.797727,303.331822,1.00,175.75,450.5,725.250,991.0
citations,2200.0,413.417273,264.366549,1.00,161.00,406.0,645.000,812.0
broad_impact,2000.0,496.699500,286.919755,1.00,250.50,496.0,741.000,1000.0
patents,2200.0,433.346364,273.996525,1.00,170.75,426.0,714.250,871.0
score,2200.0,47.798395,7.760806,43.36,44.46,45.1,47.545,100.0
year,2200.0,2014.318182,0.762130,2012.00,2014.00,2014.0,2015.000,2015.0

In [32]:
df_uni.describe(include = 'object').T

            count unique                 top freq
institution  2200   1024  Harvard University    4
country      2200     59                 USA  573

In [35]:
print(f'Nuestro Dataframe tiene {df_uni.size} datos')

Nuestro Dataframe tiene 28600 datos

2. Plantead una serie de preguntas como las que fuimos contestando en la clase invertida.

- 2.1. Qué universidad tiene más publicaciones y cuál menos
- 2.2. Qué universidad por país tiene el ránking nacional (score) más alto
- 2.3. Qué país tiene de media el mejor ránking (score)
- 2.4. Outliers de score
- 2.5. Qué universidad tiene más estudiantes y cuál menos
- 2.6. ¿Tiene relación el ranking (score) y el número de estudiantes con empleo (rank for alumni employement)?

3. Contestad a las preguntas planteadas usando los principales estadísticos que hemos aprendido y gráficas que mejor se ajusten.

2.1.

In [36]:
df_uni.columns

Index(['institution', 'country', 'national_rank', 'quality_of_education',
       'alumni_employment', 'quality_of_faculty', 'publications', 'influence',
       'citations', 'broad_impact', 'patents', 'score', 'year'],
      dtype='object')

In [42]:
df_uni['publications'].max()

1000

In [45]:
df_uni[df_uni['publications'] == df_uni['publications'].max()]

,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
world_rank,,,,,,,,,,,,,
820,"National University of Ireland, Maynooth",Ireland,7,215,478,210,1000,716,800,800.0,552,44.49,2014
830,"University of Wales, Trinity Saint David",United Kingdom,62,367,567,218,1000,927,645,754.0,871,44.20,2015

Las dos universidades con más publicaciones son  National University of Ireland, de Irlanda y University of Wales, Trinity Saint David, de Reino Unido, con 1000 publicaciones.

In [46]:
df_uni[df_uni['publications'] == df_uni['publications'].min()]

,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
world_rank,,,,,,,,,,,,,
1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.0,2012
1,Harvard University,USA,1,1,1,1,1,1,1,NaN,7,100.0,2013
1,Harvard University,USA,1,1,1,1,1,1,1,1.0,2,100.0,2014
1,Harvard University,USA,1,1,1,1,1,1,1,1.0,3,100.0,2015

Hemos buscado también las universidades con menos publicaciones, pero no nos parecen datos concluyentes, puesto que se repite la institución.

2.2. Qué universidad por país tiene el ránking nacional (score) más alto

In [55]:
df_uni_pais = df_uni.groupby(['country']).max().reset_index().sort_values('score', ascending= False)
df_uni_pais.head()

,country,institution,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
54,USA,Yeshiva University,229,367,567,218,993,974,812,946.0,871,100.00,2015
57,United Kingdom,University of York,65,367,567,218,1000,927,812,906.0,871,97.64,2015
28,Japan,Yokohama National University,74,367,567,218,999,958,812,984.0,871,80.64,2015
50,Switzerland,University of Zurich,9,367,567,218,863,635,812,671.0,787,72.18,2015
26,Israel,Weizmann Institute of Science,7,367,567,218,587,479,812,690.0,552,66.76,2015

2.3. Qué país tiene de media el mejor ránking (score)

In [53]:
df_paises = df_uni.groupby(['country'])['score'].mean().reset_index().sort_values('score', ascending= False)
df_paises.head()

           country      score
26          Israel  52.654091
54             USA  51.839860
50     Switzerland  51.208846
43       Singapore  50.160000
57  United Kingdom  49.474653